ProjectWithWsdl/Testdata/curs.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
    <SOAP-ENV:Body>
        <m:getvalueadv xmlns:m="http://www.infovalutar.ro/">
            <m:thedate>2001-12-17T09:30:47Z</m:thedate>
            <m:themoneda>EUR</m:themoneda>
        </m:getvalueadv>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>